# buttons
agree_btn		= "Да"
disagree_btn 	= "Нет"
more_btn		= "Подробнее"
male_btn		= "Мужчина"
female_btn		= "Женщина"

my_name_is_btn		= "Меня зовут {}"
my_last_name_is_btn = "Моя фамилия {}"

# states
default 			= "default"
canceled 			= "canceled"
stop				= "stop"
lets_confirm_name 	= "lets_confirm_name"
lets_confirm_last_name 	= "lets_confirm_last_name"
sex					= "sex"
age					= "age"
email 				= "email"
video_intro			= "video_intro"
trainer 			= "trainer"
ready 				= "ready"
remind				= "remind"
begin_survey		= "begin_survey"




# callback datas
agree 		= "agree"
disagree 	= "disagree"
more 		= "more"
male 		= "male"
female 		= "female"


# messages
greeting 			= 'Приветствуем Вас в 3-ёхдневной бесплатной программе от 1FitChat! Здесь мы будем анализировать Ваши пищевые привычки, режим дня и много другое. Если вы готовы продолжить работу, то нажмите *"Да"*, в противном случае нажмите *"Нет"*. Если попали сюда случайно, но Вам интересно узнать подробнее -- нажмите *"Подробнее"*.'
accepted_course 	= ''
canceled_course 	= 'Cпасибо. Адьос'
confirm_name		= 'Давайте уточним Ваше имя. Если Вас зовут {}, подтвердите это нажатием на кнопку. Если мы ошиблись, то отправьте Ваше имя в ответ на это сообщение.'
confirm_last_name 	= 'Теперь уточним фамилию. Если ваша фамилия {}, подтвердите это нажатием на кнопку. Если же нет -- отправьте нам Вашу фамилию в сообщении.'
male_or_female		= 'Вы мужчина или женщина?'
type_age			= 'Сколько вам лет?'
incorrect_age 		= 'Не похоже, чтобы это был ваш возраст. Напишите свой возраст просто числом, например: 22.'
type_email			= 'Теперь нам потребуется ваш E-mail. Отправьте его в следующем сообщении:'
incorrect_email		= 'Не похоже, чтобы это был ваш E-mail. Отправьте, пожалуйста, корректный email в формате example@mail.com'
who_we_are			= 'А сейчас посмотрите кто мы и что мы предлагаем: \n\n\n {}'
are_we_continuing	= 'Ну что, продолжаем?'
your_trainer		= 'Вам назначен тренер {} {}'
what_to_do			= 'Что делать в эти 3 дня: \n\n\n {}'
are_you_ready 		= 'Вы готовы эти 3 дня поработать с нами? Отсылать фото, замеры, анкеты?'
waiting_from_you	= '''
*Напоминаем, что мы ждём от вас: *
1. Фото всего того, что вы едите и пьёте 
2. Фото фигуры в 3-ёх ракурсах
3. Фото Вас в детстве и юности
4. Скрин шагомера (присылается утром за предыдущий день)
5. Интервал сна (во сколько легли и во сколько проснулись)
6. Заполненная Анкета
7. Результаты анализов
8. Вес (каждое утро и вечер)
'''
your_documents		= "Ваши документы"
fact_finding_remind = '''Эти 3 дня -- ознакомительные. Мы не даём никаких рекомендаций, а наблюдаем, изучаем и анализируем Ваши пищевые привычки, образ жизни и распорядок дня.
Нам это необходимо для того, чтобы чтобы впоследствие начать менять Ваше питание с той отправной точки, в которой вы находитесь сейчас. Поэтому, пожалуйста, питайтесь как Вы это обычно делаете -- ни лучше, ни хуже.
	'''

begin_survey 		= "Давайте получше познакомимся: из какого Вы города?"




# errors
action_not_defined = "Action has not defined"



# links
intro_link 		= 'https://www.youtube.com/watch?v=qHwW_ps7874'
next_3_days		= 'https://www.youtube.com/watch?v=sY1VCBNh0bw'