# buttons
agree_btn		= "Да"
disagree_btn 	= "Нет"
more_btn		= "Подробнее"
male_btn		= "Мужчина"
female_btn		= "Женщина"
my_name_is_btn		= "Меня зовут {}"
my_last_name_is_btn = "Моя фамилия {}"
continue_btn	= "Продолжить"
looked_btn		= "Посмотрел"
no_children_btn = "У меня нет детей"
support_btn		= "Поддержат"
dissuade_btn	= "Будут подшучивать/отговаривать"
many_btn		= "Много"
few_btn 		= "Мало"
middling_btn 	= "Средне"





# states
default 			= "default"
canceled 			= "canceled"
stop				= "stop"
pause				= "pause"
	#____ day_1
lets_confirm_name 	= "lets_confirm_name"
lets_confirm_last_name 	= "lets_confirm_last_name"
sex					= "sex"
age					= "age"
email 				= "email"
video_intro			= "video_intro"
trainer 			= "trainer"
ready 				= "ready"
remind_1			= "remind_1" # там просто куча напоминаний будет
city				= "city"
job 				= "job"
height 				= "height"
weight 				= "weight"
target_weight 		= "target_weight"
methodologies 		= "methodologies"
most_difficult		= "most_difficult"
was_result 			= "was_result"
why_fat_again 		= "why_fat_again"
waiting_from_you	= "waiting_from_you"
	#___ day_2
day_2				= "day_2"
tolerancy			= "tolerancy"
start_fat			= "start_fat"
why_fat 			= "why_fat"
hormonals			= "hormonals"
last_analyzes 		= "last_analyzes"
not_eat				= "not_eat"
allergy				= "allergy"

	#___ day_3
day_3				= 'day_3'
miron_story			= 'miron_story'
fats_in_family 		= 'fats_in_family'
fat_children		= 'fat_children'
relatives_attitude  = 'relatives_attitude'
amount_of_walking 	= 'amount_of_walking'
any_injuries		= 'any_injuries'
motivation			= 'motivation'
final 				= 'final'











# callback datas
agree 		= "agree"
disagree 	= "disagree"
more 		= "more"
male 		= "male"
female 		= "female"
support 	= "support"
dissuade 	= "dissuade"
many		= "many"
few 		= "few"
middling	= "middling"



# messages
greeting 			= 'Приветствуем Вас в 3-ёхдневной бесплатной программе от 1FitChat! Здесь мы будем анализировать Ваши пищевые привычки, режим дня и многое другое. Если вы готовы продолжить работу, то нажмите *"Да"*, в противном случае нажмите *"Нет"*. Если попали сюда случайно, но Вам интересно узнать подробнее -- нажмите *"Подробнее"*.'
accepted_course 	= ''
canceled_course 	= 'Cпасибо. Адьос'
confirm_name		= 'Давайте уточним Ваше имя. Если Вас зовут {}, подтвердите это нажатием на кнопку. Если мы ошиблись, то отправьте Ваше имя в ответ на это сообщение.'
type_name 			= 'Укажите, пожалуйста, своё имя'
confirm_last_name 	= 'Теперь уточним фамилию. Если ваша фамилия {}, подтвердите это нажатием на кнопку. Если же нет -- отправьте нам Вашу фамилию в сообщении.'
type_last_name		= 'Теперь введите свою фамилию'
male_or_female		= 'Вы мужчина или женщина?'
type_age			= 'Сколько вам лет?'
incorrect_age 		= 'Не похоже, чтобы это был ваш возраст. Напишите свой возраст просто числом, например: 22.'
type_email			= 'Теперь нам потребуется ваш E-mail. Отправьте его в следующем сообщении:'
incorrect_email		= 'Не похоже, чтобы это был ваш E-mail. Отправьте, пожалуйста, корректный email в формате example@gmail.com'
who_we_are			= 'А сейчас посмотрите кто мы и что мы предлагаем: \n\n\n {}'
are_we_continuing	= 'Ну что, продолжаем?'
your_trainer		= 'Вам назначен тренер {} {}'
what_to_do			= 'Что делать в эти 3 дня:\n\n\n{}'
are_you_ready 		= 'Вы готовы эти 3 дня поработать с нами? Отсылать фото, замеры, анкеты?'
waiting_from_you	= '''
*Напоминаем, что мы ждём от вас:*

1. Фото всего того, что вы едите и пьёте 
2. Фото фигуры в 3-ёх ракурсах
3. Фото Вас в детстве и юности
4. Скрин шагомера (присылается утром за предыдущий день)
5. Интервал сна (во сколько легли и во сколько проснулись)
6. Заполненная Анкета
7. Результаты анализов
8. Вес (каждое утро и вечер)
'''
your_documents		= 'Заполненные анкеты необходимо выслать на anketa3@1fitchat.ru'
fact_finding_remind = '''Эти 3 дня — ознакомительные. Мы не даём никаких рекомендаций, а наблюдаем, изучаем и анализируем Ваши пищевые привычки, образ жизни и распорядок дня.
Нам это необходимо для того, чтобы чтобы впоследствие начать менять Ваше питание с той отправной точки, в которой вы находитесь сейчас. Поэтому, пожалуйста, питайтесь как Вы это обычно делаете — ни лучше, ни хуже.
	'''
we_sent_mail		= 'Мы отправили Вам на почту несколько документов, просим Вас ознакомиться с ними'

type_city	 		= 'Давайте получше познакомимся: из какого Вы города?'
type_job			= 'А кем работаете?'
type_height			= 'Какой у вас рост? (просьба указать в сантиметрах)'
incorrect_height	= 'Не похоже, чтобы это действительно был Ваш рост. Введите, пожалуйста, корректное значение (его можно указать, например, как "175 см" или "1.75 м")'
type_weight			= 'Теперь укажите свой вес в килограммах:'
incorrect_weight	= 'Не похоже, чтобы это действительно был Ваш вес. Введите, пожалуйста, корректное значение'
type_target_weight  = 'Какую цель по весу Вы ставите перед собой?'
thanks_for_answers  = 'Спасибо Вам за ответы. Осталось ещё несколько очень важных вопросов!'
type_methodologies  = 'Какими методиками/диетами по снижению веса Вы пользовались ранее?'
type_most_difficult = 'Что было самым тяжёлым в этом процессе?'
type_was_result 	= 'Был ли результат?'
type_why_fat_again  = 'Почему вес потом возвращался, как Вы думаете?'
thanks_for_efforts  = '''Спасибо за работу в нашем первом дне 😊 
Желаем Вам приятного вечера и хорошего настроения! Продолжайте высылать фото (вечер, ночь -- всегда, когда будете есть). Завтра мы продолжим работу.
	'''
waiting_photo		= 'Ждём фото всего, что Вы едите и пьёте. Даже ночью 😊'
waiting_photo_1		= 'Не забывайте отправлять нам фото всего, что вы едите и пьёте'

greeting_2			= 'Добро пожаловать во 2-ой день нашей программы'
food_romance 		= '''Посмотрите, пожалуйста, фильм и ответьте: есть ли у Вас такой же роман с едой?

https://youtu.be/ysAyjJ7EUis'''
day_2_start			= 'Ждём скрин шагомера и интервал сна (во сколько легли и во сколько встали)'
tolerancy_movie		= '''Посмотрите, пожалуйста, этот фильм. Это важно. Просим выполнить то, о чем там говорится. Спасибо

https://www.youtube.com/watch?v=Txu8alpKXBA
'''
when_start_fat		= 'Когда Вы начали набирать вес? Какие были для этого причины?'
why_fat_now			= 'Как Вы думаете, какова причина Вашего лишнего веса на данный момент?'
hormonal_acception  = 'Принимаете ли Вы какие-нибудь гормональные препараты?'
last_analyzes_and_what = 'Когда последний раз вы сдавали анализы? Какие?'
not_eat_products	= 'Какие продукты Вы НЕ едите? (Например мясо, рыбу, морепродукты...)'
any_allergies		= 'Есть ли у вас аллергии на какие-нибудь продукты питания, непереносимости, запреты врачей?'
greeting_3			= '''{}, доброе утро! 
Мы продолжаем работу. Спасибо за материалы, которые Вы выслали. Я продолжаю задавать Вам вопросы, постарайтесь отвечать как можно более развёрнуто и подробно. Сегодня заключительный день нашего исследования.
Завтра наш Тренер сообщит вам результаты наших исследований, даст первые рекомендации.
 '''
look_at_miron_story = 'Посмотрите фильм "История Мирона"     https://www.youtube.com/watch?v=hLr0hTfgbWo'
fats_in_your_family = 'Есть ли в Вашей семье люди с лишним весом? Кто это?'
your_fat_children	= 'Есть ли у Ваших детей лишний вес?'
your_relatives_attitude = 'Как близкие отнесутся к Вашей попытке похудеть?'
your_amount_of_walking = 'Как Вы сами считаете -- в течение дня Вы ходите:'
your_injuries		= 'Есть ли у вас травмы или противопоказания, мешающие ходить больше?'
your_motivation 	= 'Какая у Вас мотивация к похудению? Зачем Вам худеть?'
fill_table			= 'Пожалуйста, заполните таблицу, иначе мы не сможем провести достоверный анализ'
reminder			= '''
Напоминаю, что жду от вас (если не прислали):

1. Фото фигуры в 3-ёх ракурсах 
2. Фото в детстве и юности 
3. Заполненная Анкета
4. Результаты анализов
'''










# errors
action_not_defined = "Action has not defined"



# links
intro_link 		  = 'https://www.youtube.com/watch?v=qHwW_ps7874'
next_3_days_link  = 'https://youtu.be/o_Q5AOBBDj0w'
measurements_link = 'https://youtu.be/LBiZHYMP7t0'